blog/2012/11/09/android-diary.org
#+TITLE: android-diary
# bhj-tags: android


* Get nv code

#+begin_src sh

# for p1, froyo version
repo init -u ssh://bearr/android/platform/manifest.git -b theatre -m theatre_p1_22.xml --repo-url=ssh://bearr/android/tools/repo.git
repo sync

# for p2, froyo version
repo init -u ssh://bearr/android/platform/manifest.git -b theatre -m theatre_p2_22.xml --repo-url=ssh://bearr/android/tools/repo.git
repo sync

# for p2, gingerbread version
repo init -u ssh://bearr/android/platform/manifest.git -b theatre -m theatre_p2_23.xml --repo-url=ssh://bearr/android/tools/repo.git
repo sync

# for p2, froyo ventana vanilla version (ventana阳春版)
repo init -u ssh://bearr/android/platform/manifest.git -b theatre -m theatre-vanilla-ventana-10.9.7.xml --repo-url=ssh://bearr/android/tools/repo.git
repo sync

#+end_src

更新：（2011-05-06）p1/p2的image和板子如果混了交叉烧的话有可能导致板子不起机。因为p2内存是1G，而p1则为512M。此外，p1上我们没有effort去跑gingerbread。

* build

#+begin_src sh
# for froyo
(cd .repo/.. && export TARGET_PRODUCT=cinema && . build/envsetup.sh && time make -j8 -l8 -k )

# for gingerbread
(cd .repo/.. && export TARGET_PRODUCT=carnation && . build/envsetup.sh && setpaths&& lunch carnation-eng && time make -j8 -l8 -k )

# 需要注意如果你的cpu是双核的，需要相应修改-j8 -l8这两个参数，一般我写成cpu核数的两倍
# 如果不改的话，有时候机器看上去像死机了似的
#+end_src

*更新* （2011-05-10）：从今天开始，不需要再去wifi目录下做一遍git clean了，我把它的build依赖关系fix了。

* 按键

键的顺序：上方，从右往左：Menu，Power，Reset（小孔，有的可能闭着的），Recovery（也是小孔），Vol+，Vol-。右侧，从上往下，Back，Home。

有些地方是标示的有点问题，比如Home键，标示成Menu了。

注意，上面说的这个键的顺序是p1板的，p2板有改过，我们可以看丝印图。（theatre-p2-silk.pdf，在vendor/nvidia/theatre-doc下）。

* 烧写

烧写需要用的文件可以是自己做full build出来，也可以直接用cm release出来的文件：比如 ~smb://dog/protected/wowpad/cm/release-20110124/cinema-r2.2.134~ 下的文件。

在Linux下烧写用的脚本是theatre-flash.sh文件，以自己build的为例，这个文件在android代码最上层的flashing目录下，烧机步骤为：

# 装了壳的板子，在SD卡槽的旁边有一个小孔，里面是recovery键，用针捅着，不要放手，然后按开机键。
# 这时候屏幕不会亮，要判断系统有没有进入烧机模式，你需要看一下lsusb的输出，有类似于下面这行的话，就说明板子已经进入了烧机模式：
#+begin_example
#+end_example
...
Bus 001 Device 028: ID 0955:7820 NVidia Corp. 
...
#+end_example
# 在android代码的最上层目录下运行下面的命令：
#+begin_src sh
(cd .repo/.. && cd flashing/ && ./theater-flash.sh)
#+end_src

** Windows下烧写

首先，点[[^nvflash-usb-pc-driver.zip][这里]]下载并安装本文附件中的usb驱动。这个操作只要执行一次就可以了。

*更新*：（2011-05-06）这个版本里有64位的Windows驱动，需要的话可以试一下。我自己是没有试过的:-)

驱动安装方法：使板子进入烧机模式，然后插到Windows的机器上，桌面通知图标区域应该弹出通知，发现新硬件，安装驱动即可。如果没有通知，则可能需要直接到设备管理器中去看。如果这里也没有，那么可能板子没有进入烧机模式，或者其他硬件问题。

然后，从2011-01-26起，不论自己build出来的还是CM release出来的，里面应该有一个theatre-flash.bat文件，双击运行这个文件即可。如果烧写出错的话，相同目录下还有一个theatre-full-flash.bat文件，试试这个。关于这两种烧写方法有何区别，参见最后的faq。

CM release出来的会放在 ~\\dog\protected\wowpad\cm\~ 下，你直接双击.bat文件是不行的，Windows对.bat文件（其实主要是cmd.exe）有限制，不得跑到网络路径上，所以你需要把相应的文件拷出来，或者更好的方法是到 ~\\dog~ 下把protected点击右键映射成一个网络驱动器比如Z:，然后到Z:盘的相应目录下双击那个.bat文件。

注意：Windows下烧机不是Nvidia官方正式支持的烧机方法，如果有问题请继续回到Linux下烧机。

* 单独编译、烧写kernel和bootloader

不要自己去kernel目录下make，这个是不支持的，如果这样做了的话，会导致full build出问题。

Nvidia自己写了一套编译kernel+ramdisk的脚本，集成在Android的build系统里，调用方法为：

#+begin_src sh
(cd .repo/.. && export TARGET_PRODUCT=cinema && . build/envsetup.sh && time make -j8 -l8 -k bootimage)
#+end_src

更新（2011-03-31）：
#+begin_src sh
(cd .repo/.. && export TARGET_PRODUCT=cinema && . build/envsetup.sh && kconfig tegra_cinema_android_defconfig && time krebuild -j8 -l8)
#+end_src

用这个方法去做kernel build，会更快，因为不需要去parse android的整个Makefile系统；此外还能自己指定用什么kernel config文件（即上面的 tegra_cinema_android_defconfig）。

烧写Kernel：

#+begin_src sh
#for 2.2
(cd .repo/.. && cd flashing/ && sudo ./nvflash --bl bootloader.bin --download 6 boot.img --go)

#for 2.3, see notes below
(cd .repo/.. && cd flashing/ && sudo ./nvflash --bl bootloader.bin --download 5 boot.img --go) 

#+end_src


编译bootloader：

#+begin_src sh
(cd .repo/.. && export TARGET_PRODUCT=cinema && . build/envsetup.sh && time make -j8 -l8 -k bootloader)
#+end_src

烧写bootloader：

#+begin_src sh
(cd .repo/.. && cd flashing/ && sudo ./nvflash --bl bootloader.bin --download 4 bootloader.bin --go)
#+end_src

*注意*，这里写着的--download后面跟的6和4，是指相应image的分区号，在目前的froyo版本的theatre里就是6/4，kernel是6，bootloader是4；但是在gingerbread里，kernel的分区变成了5。这个你可以看一下flashing git目录下的.cfg文件就明了。

* 代码review

先看一下你总共改了几个git repository，一般我用的命令是（你可以用自己的命令来达到相同的目的）：
#+begin_src sh
repo forall -c 'git diff $REPO_LREV|grep -q . && pwd'
#+end_src

当然，如果你确信自己只改了一个git repository，比如 ~kernel~ ，那么你可以跳过这一步。

然后到每一个有修改的git repository下，运行下面的几条命令：

** 先同步到最新代码

#+begin_src sh
repo sync .
#+end_src

然后可能还需要 ~git merge~ 等操作，保证你的改动是基于最新的主线代码之上的。具体操作可参考git手册。

** 确保一个review只有一个commit

在你解bug、写代码的过程中，你可以多次commit，但是最后要让别人review的时候，99%的情况下，应该只有一个commit。

所以你可能需要跑这条命令来修改你的历史记录：

#+begin_src sh
repo forall . -c 'git reset --soft $REPO_LREV'
#+end_src

然后再 ~git commit~ 一下。

