android-diary.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>android-diary</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Bao Haojun" />
<link rel="stylesheet" href="/css/default.css" type="text/css" />
<link rel="stylesheet" href="/css/org.css" type="text/css" />
 <link rel="shortcut icon" href="/poison.png" type="image/png" />

</head>
<body>
<div id="preamble" class="status">
<div id="header">

  <h1 id="blog-title">

    <a href="http://baohaojun.github.io/blog/2011/12/23/index.html">包昊军的博客</a>

  </h1>
  <p id="description">What you don't know, won't hurt you.</p>

</div>
</div>
<div id='bhj_article'>
  <div id='bhj_leftpane'>
<div id="content">
<h1 class="title">android-diary</h1>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Get nv code</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">for p1, froyo version</span>
repo init -u ssh://bearr/android/platform/manifest.git -b theatre -m theatre_p1_22.xml --repo-url=ssh://bearr/android/tools/repo.git
repo sync

<span class="org-comment-delimiter"># </span><span class="org-comment">for p2, froyo version</span>
repo init -u ssh://bearr/android/platform/manifest.git -b theatre -m theatre_p2_22.xml --repo-url=ssh://bearr/android/tools/repo.git
repo sync

<span class="org-comment-delimiter"># </span><span class="org-comment">for p2, gingerbread version</span>
repo init -u ssh://bearr/android/platform/manifest.git -b theatre -m theatre_p2_23.xml --repo-url=ssh://bearr/android/tools/repo.git
repo sync

<span class="org-comment-delimiter"># </span><span class="org-comment">for p2, froyo ventana vanilla version (ventana&#38451;&#26149;&#29256;)</span>
repo init -u ssh://bearr/android/platform/manifest.git -b theatre -m theatre-vanilla-ventana-10.9.7.xml --repo-url=ssh://bearr/android/tools/repo.git
repo sync
</pre>
</div>

<p>
更新：（2011-05-06）p1/p2的image和板子如果混了交叉烧的话有可能导致板子不起机。因为p2内存是1G，而p1则为512M。此外，p1上我们没有effort去跑gingerbread。
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> build</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">for froyo</span>
(<span class="org-builtin">cd</span> .repo/.. &amp;&amp; <span class="org-builtin">export</span> <span class="org-variable-name">TARGET_PRODUCT</span>=cinema &amp;&amp; <span class="org-builtin">.</span> build/envsetup.sh &amp;&amp; <span class="org-keyword">time</span> make -j8 -l8 -k )

<span class="org-comment-delimiter"># </span><span class="org-comment">for gingerbread</span>
(<span class="org-builtin">cd</span> .repo/.. &amp;&amp; <span class="org-builtin">export</span> <span class="org-variable-name">TARGET_PRODUCT</span>=carnation &amp;&amp; <span class="org-builtin">.</span> build/envsetup.sh &amp;&amp; setpaths&amp;&amp; lunch carnation-eng &amp;&amp; <span class="org-keyword">time</span> make -j8 -l8 -k )

<span class="org-comment-delimiter"># </span><span class="org-comment">&#38656;&#35201;&#27880;&#24847;&#22914;&#26524;&#20320;&#30340;cpu&#26159;&#21452;&#26680;&#30340;&#65292;&#38656;&#35201;&#30456;&#24212;&#20462;&#25913;-j8 -l8&#36825;&#20004;&#20010;&#21442;&#25968;&#65292;&#19968;&#33324;&#25105;&#20889;&#25104;cpu&#26680;&#25968;&#30340;&#20004;&#20493;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#22914;&#26524;&#19981;&#25913;&#30340;&#35805;&#65292;&#26377;&#26102;&#20505;&#26426;&#22120;&#30475;&#19978;&#21435;&#20687;&#27515;&#26426;&#20102;&#20284;&#30340;</span>
</pre>
</div>

<p>
<b>更新</b> （2011-05-10）：从今天开始，不需要再去wifi目录下做一遍git clean了，我把它的build依赖关系fix了。
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 按键</h2>
<div class="outline-text-2" id="text-3">
<p>
键的顺序：上方，从右往左：Menu，Power，Reset（小孔，有的可能闭着的），Recovery（也是小孔），Vol+，Vol-。右侧，从上往下，Back，Home。
</p>

<p>
有些地方是标示的有点问题，比如Home键，标示成Menu了。
</p>

<p>
注意，上面说的这个键的顺序是p1板的，p2板有改过，我们可以看丝印图。（theatre-p2-silk.pdf，在vendor/nvidia/theatre-doc下）。
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 烧写</h2>
<div class="outline-text-2" id="text-4">
<p>
烧写需要用的文件可以是自己做full build出来，也可以直接用cm release出来的文件：比如 <code>smb://dog/protected/wowpad/cm/release-20110124/cinema-r2.2.134</code> 下的文件。
</p>

<p>
在Linux下烧写用的脚本是theatre-flash.sh文件，以自己build的为例，这个文件在android代码最上层的flashing目录下，烧机步骤为：
</p>

<pre class="example">
</pre>
<p>
&#x2026;
Bus 001 Device 028: ID 0955:7820 NVidia Corp. 
&#x2026;
#+end<sub>example</sub>
</p>
<div class="org-src-container">

<pre class="src src-sh">(<span class="org-builtin">cd</span> .repo/.. &amp;&amp; <span class="org-builtin">cd</span> flashing/ &amp;&amp; ./theater-flash.sh)
</pre>
</div>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Windows下烧写</h3>
<div class="outline-text-3" id="text-4-1">
<p>
首先，点<i>这里</i>下载并安装本文附件中的usb驱动。这个操作只要执行一次就可以了。
</p>

<p>
*更新*：（2011-05-06）这个版本里有64位的Windows驱动，需要的话可以试一下。我自己是没有试过的:-)
</p>

<p>
驱动安装方法：使板子进入烧机模式，然后插到Windows的机器上，桌面通知图标区域应该弹出通知，发现新硬件，安装驱动即可。如果没有通知，则可能需要直接到设备管理器中去看。如果这里也没有，那么可能板子没有进入烧机模式，或者其他硬件问题。
</p>

<p>
然后，从2011-01-26起，不论自己build出来的还是CM release出来的，里面应该有一个theatre-flash.bat文件，双击运行这个文件即可。如果烧写出错的话，相同目录下还有一个theatre-full-flash.bat文件，试试这个。关于这两种烧写方法有何区别，参见最后的faq。
</p>

<p>
CM release出来的会放在 <code>\\dog\protected\wowpad\cm\</code> 下，你直接双击.bat文件是不行的，Windows对.bat文件（其实主要是cmd.exe）有限制，不得跑到网络路径上，所以你需要把相应的文件拷出来，或者更好的方法是到 <code>\\dog</code> 下把protected点击右键映射成一个网络驱动器比如Z:，然后到Z:盘的相应目录下双击那个.bat文件。
</p>

<p>
注意：Windows下烧机不是Nvidia官方正式支持的烧机方法，如果有问题请继续回到Linux下烧机。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 单独编译、烧写kernel和bootloader</h2>
<div class="outline-text-2" id="text-5">
<p>
不要自己去kernel目录下make，这个是不支持的，如果这样做了的话，会导致full build出问题。
</p>

<p>
Nvidia自己写了一套编译kernel+ramdisk的脚本，集成在Android的build系统里，调用方法为：
</p>

<div class="org-src-container">

<pre class="src src-sh">(<span class="org-builtin">cd</span> .repo/.. &amp;&amp; <span class="org-builtin">export</span> <span class="org-variable-name">TARGET_PRODUCT</span>=cinema &amp;&amp; <span class="org-builtin">.</span> build/envsetup.sh &amp;&amp; <span class="org-keyword">time</span> make -j8 -l8 -k bootimage)
</pre>
</div>

<p>
更新（2011-03-31）：
</p>
<div class="org-src-container">

<pre class="src src-sh">(<span class="org-builtin">cd</span> .repo/.. &amp;&amp; <span class="org-builtin">export</span> <span class="org-variable-name">TARGET_PRODUCT</span>=cinema &amp;&amp; <span class="org-builtin">.</span> build/envsetup.sh &amp;&amp; kconfig tegra_cinema_android_defconfig &amp;&amp; <span class="org-keyword">time</span> krebuild -j8 -l8)
</pre>
</div>

<p>
用这个方法去做kernel build，会更快，因为不需要去parse android的整个Makefile系统；此外还能自己指定用什么kernel config文件（即上面的 tegra<sub>cinema</sub><sub>android</sub><sub>defconfig）。</sub>
</p>

<p>
烧写Kernel：
</p>

<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">for 2.2</span>
(<span class="org-builtin">cd</span> .repo/.. &amp;&amp; <span class="org-builtin">cd</span> flashing/ &amp;&amp; sudo ./nvflash --bl bootloader.bin --download 6 boot.img --go)

<span class="org-comment-delimiter">#</span><span class="org-comment">for 2.3, see notes below</span>
(<span class="org-builtin">cd</span> .repo/.. &amp;&amp; <span class="org-builtin">cd</span> flashing/ &amp;&amp; sudo ./nvflash --bl bootloader.bin --download 5 boot.img --go)
</pre>
</div>


<p>
编译bootloader：
</p>

<div class="org-src-container">

<pre class="src src-sh">(<span class="org-builtin">cd</span> .repo/.. &amp;&amp; <span class="org-builtin">export</span> <span class="org-variable-name">TARGET_PRODUCT</span>=cinema &amp;&amp; <span class="org-builtin">.</span> build/envsetup.sh &amp;&amp; <span class="org-keyword">time</span> make -j8 -l8 -k bootloader)
</pre>
</div>

<p>
烧写bootloader：
</p>

<div class="org-src-container">

<pre class="src src-sh">(<span class="org-builtin">cd</span> .repo/.. &amp;&amp; <span class="org-builtin">cd</span> flashing/ &amp;&amp; sudo ./nvflash --bl bootloader.bin --download 4 bootloader.bin --go)
</pre>
</div>

<p>
*注意*，这里写着的&#x2013;download后面跟的6和4，是指相应image的分区号，在目前的froyo版本的theatre里就是6/4，kernel是6，bootloader是4；但是在gingerbread里，kernel的分区变成了5。这个你可以看一下flashing git目录下的.cfg文件就明了。
</p>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 代码review</h2>
<div class="outline-text-2" id="text-6">
<p>
先看一下你总共改了几个git repository，一般我用的命令是（你可以用自己的命令来达到相同的目的）：
</p>
<div class="org-src-container">

<pre class="src src-sh">repo forall -c <span class="org-string">'git diff $REPO_LREV|grep -q . &amp;&amp; pwd'</span>
</pre>
</div>

<p>
当然，如果你确信自己只改了一个git repository，比如 <code>kernel</code> ，那么你可以跳过这一步。
</p>

<p>
然后到每一个有修改的git repository下，运行下面的几条命令：
</p>
</div>

<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 先同步到最新代码</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-sh">repo sync .
</pre>
</div>

<p>
然后可能还需要 <code>git merge</code> 等操作，保证你的改动是基于最新的主线代码之上的。具体操作可参考git手册。
</p>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 确保一个review只有一个commit</h3>
<div class="outline-text-3" id="text-6-2">
<p>
在你解bug、写代码的过程中，你可以多次commit，但是最后要让别人review的时候，99%的情况下，应该只有一个commit。
</p>

<p>
所以你可能需要跑这条命令来修改你的历史记录：
</p>

<div class="org-src-container">

<pre class="src src-sh">repo forall . -c <span class="org-string">'git reset --soft $REPO_LREV'</span>
</pre>
</div>

<p>
然后再 <code>git commit</code> 一下。
</p>
</div>
</div>
