blog/2012/11/09/android-diary.org
** 提交review

#+begin_src sh
git push letou HEAD:refs/for/`tbranch`
#+end_src

*解释*：这里 ~letou~ 是NV项目的repo manifest.xml文件里定义的remote的名字。这个在别的项目（aster）上被定义为korg，这是不对的，korg应该特指kernel.org，我们不应该用这个名字。

HEAD则是说，把你当前branch（可为匿名）的HEAD（也就是最新版本）推上去做review。

*注意*：在提交review之前，需要确保你的commit comments的格式与最终的公司流程要求里规定的格式符合，否则的话，你在review完了之后为了改comments还需要再commit一次，就不合适了。因为我们的一个目标是，review完了，OK了的代码，就是直接进主线的代码。而commit comments也是review内容的一部分。

** tbranch

*注意*：上面给出的这条命令里有个 ~`tbranch`~ ，这个子命令会给出我当前代码目录是在跟踪哪个分支。使用它我们就不需要再去记忆不同的目录、不同的产品、不同的硬件分别都是在使用哪个分支，让计算机帮我们算出来，这是最好的做法。为什么这么说呢？因为这个做法符合SPOT原理。Single Point Of Truth。我的当前目录是在跟踪哪个上游分支，这是一个truth/fact，这个truth在repo manifest.xml里给出过了，我们在check-in代码的时候，最好不要提这个分支的名字，因为一提就违反了SPOT原理，一个truth出现在了多个Point上：manifest.xml中、你的命令行、我的命令行上。这样，一个地方改了这个truth，其他所有地方（所有直接使用分支名的人）都需要跟着改，没改的就得捅篓子，不知道怎么改的还得问别人，从而产生很多额外的不必要的effort。SPOT原理可参考The Art Of Unix Programming。

下面是tbranch的实现，请把它拷到你的/usr/bin/下：

#+begin_src sh
#!/bin/bash
repo forall . -c 'echo $REPO_RREV'
#+end_src

这样你以后再也不用记当前是在用theatre还是theatre-p2还是theatre-gb-p2还是aster23：

#+begin_src sh
git push letou HEAD:refs/for/`tbranch`
#+end_src

如果是最后要push到服务器上游分支，那么类似地，我也一样不写theatre等分支名，而是用tbranch：

#+begin_src sh
git push letou HEAD:`tbranch`
#+end_src

你可以用repo help forall看一下，tbranch是怎么实现的。用tbranch还有一个好处，那就是，你不大会写错branch名字。之前我有发现有位同事不小心把theatre写成了threatre，结果push到主线之后cm那边却没build出来。

** 添加reviewer

当你跑完push到review的命令，输出中会有一行，包含一个网页URL，类似于 ~http://bear/gerrit/#change,16~ ，你登录这个网页，就可以添加让谁来帮你review代码了。（你可以点一下这个链接，看一下以后我们经常会用的界面是啥样的）

** 提交代码

这一步应该大家都会做了，就是 ~git push letou HEAD:`tbranch`~ 。

当你的reviewer review完你的代码，他可以直接在上面的这个网页里操作，如果approve了，系统会自动给你发一封邮件，告诉你OK了，这时候你就可以把代码提交到主线上了。

** 二次review

有时候一次review是不够的，你的代码中可能包含某些错误，别人帮你review出来了；或者你根本操作的时候搞错了，提交了错误版本的代码。比如你当前做的feature，同时需要在NV和freescale上实现，然后你把freescale的代码给提交到NV的branch上做review，这就是第二种错误。

针对这两种错误，我们有两种不同的处理方式，可以根据实际情况自己选择：

*** 提交新的patchset

这个主要针对第一种错误。在别人帮你review出错误之后，你把这些错误修正了，然后再次 ~git commit~ ，注意两点：a) 加--amend参数；b) 保持comments里的Change-Id不变。

如果你不加--amend参数，那么你手里就会有两个commit了，上一次的和这一次的。这个我们之前就说过是要避免的。（如果已经搞出两个commit出来，可以用 ~git reset --soft~ 修改你私有的历史记录，所以不用担心）

如果你不保持Change-Id不变，那么你提交review的时候，gerrit里就会生成一个新的review，而不是在旧的review上生成一个新的patchset。

如果你一不小心弄错了，Change-Id变了，生成了一个新的review，那么你需要下面的操作，至少把旧的review给abandon掉。一直挂在上面是不好的，无效的review如果太多了的话，会把有用的review给淹没。

*** Abandon review

当你完全提交错了的情况下，你可以到gerrit里直接按那个Abandon Change按钮，这样这个change就无效了。

需要指出的是，我们“鼓励”你多犯错误。不是所有的错误都像build error那样会被罚款的。如果你不敢提交到主线，可以提交到gerrit review上来，因为在这里，犯了错误是可以改正的。而且大家可以帮你一起看、一起学习。当然，你需要保证代码的一个基本质量，否则就是浪费大家的时间。

* 代码组织示例

在这里会陆续告诉大家一些NV项目里的代码是怎么组织的。我们的NV项目从硬件原理图上就非常closely的follow NV的参考设计，软件也是如此。现在必须这样做，因为如果不follow的话，可能会有很大的风险，都需要自己承担。

而软件方面，NV是有着自己的一套代码组织方法，可能跟常见的开源软件不大一样。其原因是因为它有自己的操作系统，并且还需要支持Linux、Windows。而它基本上希望以一套代码（至少是一套API）来实现这些支持。

所以在NV的kernel代码里，你除了正规的Linux kernel的api，还会见到NV自己的api。API名字虽然不同，但是其实它们做的是非常类似的事，所以简单了解一下即可，不必panic。

同时告诉大家一个好消息，在强大的开源社区面前，NV的代码会在gingerbread、honeycomb里完全follow正规api。因为这些版本android的kernel是google帮忙porting的，人家哪会鸟NV自己的api呢:-)

** GPIO的使用

NV的gpio命名是以字母a-z分组，每组有8个gpio。所以你会看到类似于gpio_ps5的名字，意思就是s组的5管脚（注意是从管脚0开始数，所以其实是第6个）。想计算这个名字在代码里应该对应gpio管脚的序号是多少，可以用我写的一个[[http://github.com/baohaojun/system-config/raw/master/bin/Linux/nvgpio][小脚本]]，用法如下： ~nvgpio s 5~ 。

或者直接参考kernel/arch/arm/mach-tegra/gpio-names.h。

#+begin_src c
#define TEGRA_GPIO_PA0		0
#define TEGRA_GPIO_PA1		1
#define TEGRA_GPIO_PA2		2
...
#define TEGRA_GPIO_PO5		117
#define TEGRA_GPIO_PO6		118
#define TEGRA_GPIO_PO7		119
#define TEGRA_GPIO_PP0		120
...
#+end_src


如果想在用户空间操作output gpio的输出电平拉高、拉低，或者读取input gpio的输入电平被拉高、拉低，可以考虑/sys/class/gpio（用法见kernel Documentation）。这一招在bring-up的时候非常有用。

比如下面这段代码就把123这个gpio（gpio_pp3）给拉成输出高电平。
#+begin_src sh
cd /sys/class/gpio
echo 123 > export
cd gpio123
echo out > direction
echo 1 > vale
#+end_src

如果想知道用kernel自己的api在NV项目里怎么操作gpio，可参考下面的代码：

#+begin_src none
    /home/bhj/src/theatre/kernel/arch/arm/mach-tegra/board-ventana-wifi.c:39:     gpio_set_value(VENTANA_WLAN_PWR, on);
        static int ventana_wifi_power_state;
        static int ventana_wifi_power(int on)
        {
            ...
    =>      gpio_set_value(VENTANA_WLAN_PWR, on);
#+end_src

如果想知道NV自己的api是怎么操作gpio（大部分gpio都是如此操作），可参考下面的代码：

#+begin_src none
这里是在C代码里设wifi用了哪个gpio，这个文件里还能看到大部分的i2c设备在NV的代码体系里是怎么设置总线、地址的：

    /scp:bhj@192.168.88.9:/home/bhj/src/theatre/kernel/arch/arm/mach-tegra/odm_kit/query/ventana/subboards/nvodm_query_discovery_pm275_addresses.h:351:     { NvOdmIoModule_Gpio, 'k'-'a', 0x6, 1 },                    /* GPIO Port K and Pin 6 - WIFI_RST */
        // Wlan
        static const NvOdmIoAddress s_WlanAddresses[] =
        {
            ...
    =>      { NvOdmIoModule_Gpio, 'k'-'a', 0x6, 1 },                    /* GPIO Port K and Pin 6 - WIFI_RST */

****************************************************************
这里是在获取哪个gpio管脚是gsensor的管脚：

    /scp:bhj@192.168.88.9:/home/bhj/src/theatre/kernel/arch/arm/mach-tegra/odm_kit/platform/accelerometer/nvodm_accelerometer_kxtf9.c:817:                 FoundGpio = NV_TRUE;
        NvBool kxtf9_init(NvOdmAccelHandle* hDevice)
        {
            ...
            {
                ...
                {
                    ...
                    case NvOdmIoModule_Gpio:
                        ...
    =>                  FoundGpio = NV_TRUE;

****************************************************************
这里是在设gsensor的gpio管脚中断：

    /scp:bhj@192.168.88.9:/home/bhj/src/theatre/kernel/arch/arm/mach-tegra/odm_kit/platform/accelerometer/nvodm_accelerometer_kxtf9.c:362:     if (NvOdmGpioInterruptRegister(hDevice->hGpioINT,
        static NvBool ConfigInterrupt(NvOdmAccelHandle hDevice)
        {
            ...
    =>      if (NvOdmGpioInterruptRegister(hDevice->hGpioINT,

#+end_src

*** debugfs下的gpio

如果不能export，又不想走kernel改code、烧入、reboot等一大串的流程，嫌它太浪费时间，并且只是想看一下当前某个gpio是不是被配置，被配成in还是out了，逻辑电平是高还是低，那么，你可以用debugfs，它提供gpio的一些信息。此外，/proc/interrupts底下也有一些gpio中断是否被触发过，触发过多少次的信息。

想看debugfs下的gpio，使用命令如下：

#+begin_src sh
mkdir /data/debugfs
mount -t debugfs null /data/debugfs
cat /data/debugfs/gpio
#+end_src

