blog/2012/11/09/android-diary.org
** Pinmux的查询

跟gpio非常相关的一个概念就是pinmux。所谓pinmux，也就是管脚复用的意思。从tegra2的trm文档里可以了解、查询到最详细的pinmux信息。我也是经过一段时间的学习之后才慢慢理解了什么是pinmux。

嵌入式cpu，为了做得比较通用、灵活，同时也为了节省成本，往往会赋予一个管脚多种功能，客户可以根据自己的需要，在设计系统的时候，选择、决定每个管脚的功能。

举例来说，比如一个led功能，可能并不是每个客户设计的系统都有led，所以如果没有pinmux的话，你的cpu专门为led设计一个专用管脚，则这个管脚对不用led的客户就是浪费了；如果你把这个管脚拿掉，则需要led功能的客户的需求不能满足，你的cpu就不够灵活。

此外，一个管脚可以选择几个功能；同样的，一个功能也可以出现在多个管脚上。这两个是相辅相成，不可分割的。前者必然导致后者，后者也必然导致前者。比如，我的管脚p1能配3个功能，f1, f2, f3，那么，在我设计的某个特定系统中，我选择让p1管脚出功能f1，可是同时我还希望能有功能f2，所以功能f2必须能配到另外一个管脚上，这样前者就推出了后者。反之亦然。比如，我的功能f1可以配到3个管脚上，p1, p2, p3，那么，在我设计的某个特定系统中，我已经决定让f1配到p1管脚上，这时，如果前者不成立，一个管脚只能有一个功能，那我的p2、p3管脚就浪费了。所以后者就推出了前者（严谨吧？告诉你一个小秘密，我差点读了数学系）。

这就是pinmux。大多数管脚除了它们自己特定的2~3个功能之外，还都可以配成一个通用的功能。这就是gpio。

所以在原理图上，你会看到一个管脚的序号、主功能名，而在pinmux文件中（我们的NV项目没有出pinmux表，我们可以基于另外一个项目的pinmux表，在vendor/nvidia/theatre-doc/pinmux/下），我们可以看到这个管脚的次功能名和gpio名。这个比查trm文档方便一些，但是还是比较麻烦，所以（谢谢佟波的建议）我提供一个脚本[[http://github.com/baohaojun/system-config/raw/master/bin/Linux/nvpinmux][nvpinmux]]，可以方便地查看一个管脚的管脚名、pinmux功能名、gpio名。

这个脚本需要你把[[http://github.com/baohaojun/system-config/raw/master/doc/pinmux.csv][这个文件]]放到你的~/system-config/doc目录下。

使用方法：
#+begin_src none
$nvpinmux pw2
AA24 LCD_PWR2 GPIO_PC6
P22 SPI2_CS1_N GPIO_PW2
#+end_src

如果你觉得这个脚本给出的信息不够的话，你可以自己再完善一下:-)

** I2C的使用

NV自己的体系用法，可以参考上面gpio，在上述文件的gpio附近能看到对nv i2c api的使用。

正规kernel的用法，可以参考drivers/hwmon/mm_ak8975.c，以及下面的代码：

#+begin_src none
    /scp:bhj@192.168.88.9:/home/bhj/src/theatre/kernel/arch/arm/mach-tegra/board-generic.c:191:         I2C_BOARD_INFO("mm_ak8975", 0x0C),
        static struct i2c_board_info bus4_i2c_devices[] = {
        #ifdef CONFIG_SENSORS_AK8975
            {
    =>          I2C_BOARD_INFO("mm_ak8975", 0x0C),
#+end_src

*** i2c-tools的使用

编写i2c驱动，一个非常非常重要、不可或缺的工具，叫i2c-tools。这个我已经放进NV的code里，大家直接就可以用了。

我最经常用的有两种用法：

**** 用i2cdetect看某条总线上有多少i2c设备。

比如下面这个例子，i2cdetect就在i2c-0总线上检测到了三个设备，分别在地址0x1a，0x44，0x5c上面。

这种用法对于一个spec里没有清晰指出设备i2c地址的元件，非常有用。不需要花时间去来回问vendor support了。

#+begin_src none
$adb shell i2cdetect -y -r 0
     0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f
00:          -- -- -- -- -- -- -- -- -- -- -- -- -- 
10: -- -- -- -- -- -- -- -- -- -- 1a -- -- -- -- -- 
20: -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- 
30: -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- 
40: -- -- -- -- 44 -- -- -- -- -- -- -- -- -- -- -- 
50: -- -- -- -- -- -- -- -- -- -- -- -- 5c -- -- -- 
60: -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- 
70: -- -- -- -- -- -- -- --   
#+end_src

**** 用i2cget读取某个i2c设备的某个寄存器

略。

**** 用i2cset写某个i2c设备的某个寄存器。

详情请看 ~man i2cget~ 等。（没错，ubuntu/debian上有i2c-tools，apt-get install一下就好了）

更新（2011-04-19）：在NV系统上，有些设备可以用i2cget/i2cset读、写其寄存器，但是有些设备却不行，会返回resource busy错误。这是因为NV的有些设备的驱动是用它自己的架构写，有些是用kernel标准的device/driver的架构写，后者就不允许随便的用i2cget/i2cset了。如果实在想要用的话，必须用 -f 选项。比如p2b的touch驱动就碰到了这个问题，早先的touch设备是可以直接不加 -f 用i2c-tools操作的，但是现在我们用kernel标准架构重写了它的驱动，结果就必须加 -f 选项了。

* Gingerbread

NV的工程师已经帮我们把gingerbread在咱们的板子上跑了起来，我把代码整合了一下，现在可以放到p2的板子上跑。p1的板子可能需要改一下kernel和vendor/nvidia底下的代码，以及flashing底下的烧写程序。怎么改的话看一下git log我就能想起来。

目前只能点亮lcd，用远程桌面（google androidscreencast.jnlp）的话可以把视频播放起来。远程桌面不会有显示，但是鼠标、键盘是可用的。

接下来大量的driver需要port到gb上，因为现在的kernel不再使用nvidia的api，而是正规的kernel api。

** 如何编译

默认一定要用64位的系统了，所以你可能需要重装系统。并且prebuilt底下的arm-eabi-gcc还是32位版本的，所以你需要装一些32bit的库：

#+begin_src sh
for x in gcc-multilib g++-multilib ia32-libs ia32-libs-gtk lib32ncurses5-dev lib32readline6-dev lib32z1-dev lib32z-dev libc6-dev-i386; do sudo apt-get install -y $x; done
#+end_src

*** 如何编译android

#+begin_src sh
(cd .repo/.. && export TARGET_PRODUCT=ventana && . build/envsetup.sh && setpaths&& lunch ventana-eng && time make -j8 -l8 -k )
#+end_src

*** 如何编译kernel

#+begin_src sh
(cd .repo/.. && export TARGET_PRODUCT=ventana && . build/envsetup.sh && setpaths&& lunch ventana-eng && ksetup tegra_defconfig && krebuild -j8)
#+end_src

注意上面的这种编译kernel的方法，比用android自带的build系统去(make bootimage)，要快一些，因为不需要parse Android的庞大的Makefile。

而且，在gb-tegra里面，可能已经不能用android的build系统make bootimage来编译kernel，必须用krebuild了。这个命令是在vendorsetup.sh里定义的。

* FAQ

** wifi出错

注意前面我给出的所有编译命令，都会到wifi驱动的代码目录下做一个git clean。这是因为这个驱动的代码是独立于kernel编译的，其makefile写得有问题，不能正确更新wifi驱动与kernel保持一致，最终导致驱动load失败。

** build OK，没看到system.img

在这个目录：out/target/product/ventana/system 底下，如果没有看到system.img的话，可能是你的build env没有设对。变成build generic了。晏峰碰到了这个问题。

在标准的android教程里，可能都会告诉你，每次打开一个terminal，先设一下环境，也就是buildenv.sh、lunch等命令。

这样做，我认为不好。首先，我怎么才能记得每次打开一个terminal都要设一下环境呢？万一某个terminal我没有设过，直接build了，出来的是generic的image，而不是我想要的ventana的image，这样就太浪费时间和感情了（害我白等0.5~1个小时）。

其次，设了android的环境之后，引入了一些我不想要的东西。比如help命令，这是一个bash自带的命令，可是android的环境把它重定义了。

这就是为什么我给出的命令都类似于下面的格式：

#+begin_src sh
(cd .repo/.. && export TARGET_PRODUCT=ventana && . build/envsetup.sh && setpaths&& lunch ventana-eng && ksetup tegra_defconfig && krebuild -j8)
#+end_src

这里，最外面的括号“()”直接启动了一个子shell，在这个子shell里，我把android需要的环境给设上，并且开始build。build一结束，这些环境就随着这个子shell一起烟消云散了。

基于以上的两个原因，我非常喜欢用子shell的形式来给出命令。

** LCD连接线怎么接

最早的lcd线，两头是一样的，哪头接lcd，哪头接板子，都可以。

后来的lcd线，做了cost reduction，必须用固定的一头接lcd，另一头接板子，如果接错的话，lcd是不会亮的（但是倒也不会烧板子，所以目前（2011-03-24）是不需要担心这个的）。

可以这样简单地区分哪头是哪头：接lcd的那一头，左三右四。也就是说，把正确的那头对准lcd的connector，从左边数应该有3根紧挨着的线，从右边数应该有4根紧挨着的线。

** 远程桌面

在连着adb的时候，用本文附件中的androidscreencast.jnlp可以用远程桌面登录android设备。需要apt-get install openjdk-6-jdk。运行方法：

#+begin_src sh
LANG=C LC_ALL=C javaws androidscreencast.jnlp
#+end_src

前面的两个环境变量的设置是为了让这个远程桌面程序使用英文字体。如果发现字体显示异常并且你的环境是中文的话，可以用这个选项。我一般选的语言设置是 ~en_US.UTF-8~ 。

注意一定要用1.6版本的javaws，我们现在很多同事用的都是1.5版本jdk，可以用

#+begin_src sh
type -a javaws
#+end_src

看一下你的javaws是在哪个目录下，是什么版本。

** 怎么做touch的calibration

#+begin_src sh
adb shell i2cset -f -y 0x0 0x5c 0x37 3
adb shell i2cset -f -y 0x0 0x41 0xcc 3
#+end_src

有两种touch，所以上面这两条命令跑一条就可以，但是两条都跑就两种touch都能包含了，不要管哪种touch对应哪条命令。

